const policy = `
<h3 class="text-center">導言</h3>
<p class="text-i2">
錘子漫畫 是一款由 Mechanic, James (以下簡稱「我們」）提供的產品。
您在使用我們的服務時，我們可能會收集和使用您的相關信息。我們希望通過本《隱私政策》向您說明，在使用我們的服務時，我們如何收集、使用、儲存和分享這些信息，以及我們為您提供的訪問、更新、控制和保護這些信息的方式。
本《隱私政策》與您所使用的 <i>錘子漫畫</i> 服務息息相關，希望您仔細閱讀，在需要時，按照本《隱私政策》的指引，作出您認為適當的選擇。本《隱私政策》中涉及的相關技術詞彙，我們盡量以簡明扼要的表述，並提供進一步說明的鏈接，以便您的理解。
</p>
<p class="text-i2"><strong>您使用或繼續使用我們的服務，即意味著同意我們按照本《隱私政策》收集、使用、儲存和分享您的相關信息。</strong></p>
<p class="text-i2">如對本《隱私政策》或相關事宜有任何問題，請通過 <strong>beatrixreichenbach8@gmail.com</strong> 與我們聯繫。</p>

<h3 class="text-center">1. 我們收集的信息</h3>
<p class="text-i2">我們或我們的第三方合作夥伴提供服務時，可能會收集、儲存和使用下列與您有關的信息。如果您不提供相關信息，可能無法註冊成為我們的用戶或無法享受我們提供的某些服務，或者無法達到相關服務拟達到的效果。</p>
<ul>
<li><strong>歸因信息</strong>，指您使用我們的服務時，我們會收集、分析和報告的有關用戶行為及廣告效果的相關數據，包括<strong>登錄</strong>、<strong>註冊</strong>、<strong>商品購買</strong>等等。部分數據將被上報至我們的<strong>官方網站(<a href="https://www.hamrcomic.com/">https://www.hamrcomic.com/</a>)</strong>以及<strong>Adjust(<a href="https://suite.adjust.com/">https://suite.adjust.com/</a>)平台</strong>，以幫助我們改進產品和優化您的體驗。</li>
<li><strong>日誌信息</strong>，指您使用我們的服務時，系統可能通過cookies、標識符及相關技術收集的信息，包括您的<strong>設備信息</strong>、<strong>瀏覽信息</strong>、<strong>點擊信息</strong>，並將該等信息儲存為日誌信息，為您提供個性化的用戶體驗、保障服務安全。您可以通過瀏覽器設置拒絕或管理cookie、標識符或相關技術的使用。</li>
<li><strong>個人信息</strong>，您在註冊賬戶或使用我們的服務時，向我們提供的相關個人信息，例如電話號碼、電子郵件等。爲了提供更好的服務和功能，我們可能需要獲取您的手機相機權限和相冊訪問權限。我們將僅在您明確授權的情況下訪問和使用這些權限，以便您可以拍攝照片或選擇圖片作爲應用程序的一部分。</li>
</ul>
<h3 class="text-center">2. 信息的儲存</h3>
<strong>2.1 信息儲存的方式和期限</strong>
<ul>
<li>我們會通過安全的方式儲存您的信息，包括本地儲存（例如利用APP進行數據緩存）、數據庫和服務器日誌。</li>
<li>一般情況下，我們只會在為實現服務目的所必需的時間內或法律法規規定的條件下儲存您的個人信息。</li>
</ul>

<strong>2.2 信息儲存的地域</strong>
<ul>
<li>我們會按照法律法規規定，將境內收集的用戶個人信息儲存於中國境內。</li>
<li>目前我們不會跨境傳輸或儲存您的個人信息。將來如需跨境傳輸或儲存的，我們會向您告知信息出境的目的、接收方、安全保證措施和安全風險，並征得您的同意。</li>
</ul>

<strong>2.3 產品或服務停止運營時的通知</strong>
<ul>
<li>當我們的產品或服務發生停止運營的情況時，我們將以推送通知、公告等形式通知您，並在合理期限內刪除您的個人信息或進行匿名化處理，法律法規另有規定的除外。</li>
</ul>

<h3 class="text-center">3. 信息安全</h3>
<p class="text-i2">
我們使用各種安全技術和程序，以防信息的丟失、不當使用、未經授權閱覽或披露。例如，在某些服務中，我們將利用加密技術（例如SSL）來保護您提供的個人信息。但請您理解，由於技術的限制以及可能存在的各種惡意手段，在互聯網行業，即便竭盡所能加強安全措施，也不可能始終保證信息百分之百的安全。您需要了解，您接入我們的服務所用的系統和通訊網路，有可能因我們可控範圍外的因素而出現問題。
</p>
<p class="text-i2">
我們承諾將以最嚴格的標準保護您的隱私，並確保您的個人數據不會被外洩。我們將嚴格遵守隱私法規，只會在合法、透明的前提下使用這些數據。
</p>

<h3 class="text-center">4. 我們如何使用信息</h3>
<p class="text-i2">我們可能將在向您提供服務的過程之中所收集的信息用作下列用途：</p>
<ul>
<li>向您提供服務；</li>
<li>在我們提供服務時，用於身份驗證、客戶服務、安全防範、詐騙監測、存檔和備份用途，確保我們向您提供的產品和服務的安全性；</li>
<li>幫助我們設計新服務，改善我們現有服務；</li>
<li>幫助我們改進產品和優化您的體驗；</li>
<li>使我們更加了解您如何接入和使用我們的服務，從而針對性地回應您的個性化需求，例如語言設定、位置設定、個性化的幫助服務和指示，或對您和其他用戶作出其他方面的回應；</li>
<li>向您提供與您更加相關的廣告以替代普遍投放的廣告；</li>
<li>評估我們服務中的廣告和其他促銷及推廣活動的效果，並加以改善；</li>
<li>軟體認證或管理軟體升級；</li>
<li>讓您參與有關我們產品和服務的調查。</li>
<li>我們僅將您從相機和相冊中獲取的照片用於應用程序的特定目的，例如上傳到應用程序內的社交媒體功能、個人資料設置、創建內容、二維碼掃描等。我們不會將您從相機和相冊中獲取的照片用於任何其他商業用途，也不會與任何第三方共享這些照片。</li>
</ul>

<h3 class="text-center">5. 信息共享</h3>
<p class="text-i2">
目前，我們不會主動共享或轉讓您的個人信息至第三方，如存在其他共享或轉讓您的個人信息或您需要我們將您的個人信息共享或轉讓至第三方情形時，我們會直接或確認第三方征得您對上述行為的明示同意。
</p>
<p class="text-i2">
為了投放廣告，評估、優化廣告投放效果等目的，我們需要向廣告主及其代理商等第三方合作夥伴共享您的部分數據，要求其嚴格遵守我們關於數據隱私保護的措施與要求，包括但不限於根據數據保護協議、承諾書及相關數據處理政策進行處理，避免識別出個人身份，保障隱私安全。
</p>
<p class="text-i2">
我們不會向合作夥伴分享可用於識別您個人身份的信息（例如您的姓名或電子郵件地址），除非您明確授權。
</p>
<p class="text-i2">
我們不會對外公開披露所收集的個人信息，如必須公開披露時，我們會向您告知此次公開披露的目的、披露信息的類型及可能涉及的敏感信息，並征得您的明示同意。
</p>
<p class="text-i2">
隨著我們業務的持續發展，我們有可能進行合併、收購、資產轉讓等交易，我們將告知您相關情形，按照法律法規及不低於本《隱私政策》所要求的標準繼續保護或要求新的控制者繼續保護您的個人信息。
</p>
<p class="text-i2">
另外，根據相關法律法規及國家標準，以下情形中，我們可能會共享、轉讓、公開披露個人信息無需事先徵得您的授權同意：
</p>
<ul>
<li>與國家安全、國防安全直接相關的；</li>
<li>與公共安全、公共衛生、重大公共利益直接相關的；</li>
<li>犯罪偵查、起訴、審判和判決執行等直接相關的；</li>
<li>出於維護個人信息主體或其他個人的生命、財產等重大合法權益但又很難得到本人同意的；</li>
<li>個人信息主體自行向社會公眾公開個人信息的；</li>
<li>從合法公開披露的信息中收集個人信息的，如合法的新聞報道、政府信息公開等渠道。</li>
</ul>

<h3 class="text-center">6. 您的權利</h3>
<p class="text-i2">
在您使用我們的服務期間，我們可能會視產品具體情況為您提供相應的操作設置，以便您可以查詢、刪除、更正或撤回您的相關個人信息，您可參考相應的具體指引進行操作。此外，我們還設置了投訴舉報渠道，您的意見將會得到及時的處理。如果您無法通過上述途徑和方式行使您的個人信息主體權利，您可以通過本《隱私政策》中提供的聯絡方式提出您的請求，我們會按照法律法規的規定予以反饋。
</p>

<h3 class="text-center">7. 變更</h3>
<p class="text-i2">
我們可能適時修訂本《隱私政策》的條款。當變更發生時，我們會在版本更新時向您提示新的《隱私政策》，並向您說明生效日期。請您仔細閱讀變更後的《隱私政策》內容，<strong>若您繼續使用我們的服務，即表示您同意我們按照更新後的《隱私政策》處理您的個人信息。</strong>
</p>

<h3 class="text-center">8. 未成年人保護</h3>
<p class="text-i2">
我們鼓勵父母或監護人指導未滿十八歲的未成年人使用我們的服務。我們建議未成年人鼓勵他們的父母或監護人閱讀本《隱私政策》，並建議未成年人在提交的個人信息之前尋求父母或監護人的同意和指導。
</p>
<div class="mt-3">
	<div>更新日期：2023/12/28</div>
	<div>生效日期：2023/12/28</div>
</div>
<div class="text-right">
	感謝您的耐心閱讀
</div>
`

const agreement = `
<p class="text-i2 text-center">Mechanic, James（以下簡稱「我們」）依據本協議為用戶（以下簡稱「你」）提供 錘子漫畫 服務。本協議對你和我們均具有法律約束力。</p>
<h4 class="text-center">一、本服務的功能</h4>
<p class="text-i2 text-center">你可以使用本服務漫畫瀏覽與閱讀，小說瀏覽與閱讀，會員服務等等。</p>
<h4 class="text-center">二、責任範圍及限制</h4>
<p class="text-i2 text-center">你使用本服務得到的結果僅供參考，實際情況以官方為準。</p>
<h4 class="text-center">三、隱私保護</h4>
<p class="text-i2 text-center">我們重視對你隱私的保護，你的個人隱私信息將根據《隱私政策》受到保護與規範，詳情請參閱《隱私政策》。</p>
<h4 class="text-center">四、其他條款</h4>
<p class="text-i2 text-center">4.1 本協議所有條款的標題僅為閱讀方便，本身並無實際涵義，不能作為本協議涵義解釋的依據。</p>
<p class="text-i2 text-center">4.2 本協議條款無論因何種原因部分無效或不可執行，其餘條款仍有效，對雙方具有約束力。</p>
<div class="mt-3">
	<div>更新日期：2023/12/28</div>
	<div>生效日期：2023/12/28</div>
</div>
<div class="text-right">
	感謝您的耐心閱讀
</div>
`


module.exports = {
	policy,
	agreement
}